---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtEnd
source: html/c3518f55-e6b3-3c39-e56f-8cd8b8c49add.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtEnd Property

"Hook Rotation At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeHookRotationAtEnd { get; }
```